cs546/cs546HW5/gol/hw5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-27 Mon 22:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cs546 hw5 CUDA Programming on Comet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Christopher Hannon" />
<link rel="stylesheet" type="text/css" href="../css/notebook.css" />


</head>
<body>
<div id="content">
<h1 class="title">cs546 hw5 CUDA Programming on Comet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org23ae221">How to install</a></li>
<li><a href="#org71261f6">Usage</a></li>
<li><a href="#orgc03b3e7">Algorithms</a></li>
<li><a href="#org04a5ceb">Screenshots</a></li>
<li><a href="#org1b89b96">Reference</a></li>
</ul>
</div>
</div>

<div id="outline-container-org23ae221" class="outline-2">
<h2 id="org23ae221">How to install</h2>
<div class="outline-text-2" id="text-org23ae221">
<p>
./setup.sh 
</p>

<p>
The setup file compiles, and queues the sequential and cuda versions.
</p>
</div>
</div>

<div id="outline-container-org71261f6" class="outline-2">
<h2 id="org71261f6">Usage</h2>
<div class="outline-text-2" id="text-org71261f6">
<p>
Change the Size of N by modifying SCREENX and SCREENY in the defines of GoLS.c and GoLCuda.cu
</p>
</div>
</div>

<div id="outline-container-orgc03b3e7" class="outline-2">
<h2 id="orgc03b3e7">Algorithms</h2>
<div class="outline-text-2" id="text-orgc03b3e7">
<p>
The algorithm is actually quite simple, we initialize a random array of NxM integer values. 
 The 2D world is stored in a 1D Array of size (sizeof(integer)*N*M). The next step is to iterated through the world and update the values.
 The new values should not overwrite the origional array until the whole world is traversed. 
 The parallel version splits the world into blocks and uses data parallelism to speed up.
</p>


<p>
Empirical data from Comet on XSEDE using sequential and CUDA 7.0 shows Execution time of:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">N</th>
<th scope="col" class="org-left">100</th>
<th scope="col" class="org-left">1000</th>
<th scope="col" class="org-left">10000</th>
<th scope="col" class="org-left">25000</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Serial Version</td>
<td class="org-left">0.539 s</td>
<td class="org-left">60.46 s</td>
<td class="org-left">&#x2014; s</td>
<td class="org-left">&#x2014; s</td>
</tr>

<tr>
<td class="org-left">Cuda Version</td>
<td class="org-left">0.036 s</td>
<td class="org-left">0.986 s</td>
<td class="org-left">73.86 s</td>
<td class="org-left">&#x2014; s</td>
</tr>
</tbody>
</table>


<p>
Empirical data from Comet on XSEDE using sequential and CUDA 7.0 shows Execution time per frame of:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">N</th>
<th scope="col" class="org-left">100</th>
<th scope="col" class="org-left">1000</th>
<th scope="col" class="org-left">10000</th>
<th scope="col" class="org-left">25000</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Serial Version</td>
<td class="org-left">0.00061 s</td>
<td class="org-left">0.068 s</td>
<td class="org-left">&#x2014; s</td>
<td class="org-left">&#x2014; s</td>
</tr>

<tr>
<td class="org-left">Cuda Version</td>
<td class="org-left">0.00004 s</td>
<td class="org-left">0.0012 s</td>
<td class="org-left">0.0845 s</td>
<td class="org-left">&#x2014; s</td>
</tr>
</tbody>
</table>

<p>
Here we can see that the serial version is capped at 1000 due to execution time (greater than 1 hour) and the Cuda version vastly outperforms the serial version.
</p>
</div>
</div>

<div id="outline-container-org04a5ceb" class="outline-2">
<h2 id="org04a5ceb">Screenshots</h2>
<div class="outline-text-2" id="text-org04a5ceb">
<p>
Screen shots can be found in ./results/* where the directory names are the sizes of N.
</p>
</div>
</div>

<div id="outline-container-org1b89b96" class="outline-2">
<h2 id="org1b89b96">Reference</h2>
<div class="outline-text-2" id="text-org1b89b96">
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/459691/best-timing-method-in-c">https://stackoverflow.com/questions/459691/best-timing-method-in-c</a></li>
<li><a href="https://devtalk.nvidia.com/default/topic/453819/cuda-programming-and-performance/the-game-of-life-in-cuda/2">https://devtalk.nvidia.com/default/topic/453819/cuda-programming-and-performance/the-game-of-life-in-cuda/2</a></li>
<li><a href="https://en.wikipedia.org/wiki/Conway's_Game_of_Life">https://en.wikipedia.org/wiki/Conway's_Game_of_Life</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Christopher Hannon</p>
<p class="date">Created: 2017-11-27 Mon 22:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
